#+TITLE:
#+DATE:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:nil toc:nil \n:nil @:t ::t |:t ^:{} -:t f:t *:t <:t ':t ^:{}
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:nil pri:nil tags:not-in-toc
#+OPTIONS: texht:nil
#+LATEX_CLASS: plos-devel
#+STARTUP: entitiespretty

#+call: plos-one-start(kwd="TITLE") :wrap latex

** Preamble Source Code

The source code block =plos-one-start= is called before the first
headline. It takes information from the =author-table= and creates a
title page that meets the following [[http://www.plosone.org/static/guidelines#format][/PLOS ONE/ specification]]:

#+begin_quote
The title, authors, and affiliations should all be included on a title
page as the first page of the manuscript file.
#+end_quote

#+name: plos-one-start
#+header: :var tab=author-table
#+header: :var kwd="TITLE"
#+header: :results raw 
#+header: :wrap latex
#+header: :colnames no 
#+header: :hlines yes
#+header: :noweb yes
#+header: :exports results
#+begin_src emacs-lisp
  <<jk-keywords>>
  (require 'cl)
  (defun author-name (recs)
    "Format the author name list."
    (let ((i 0))
      (mapcar (lambda (row)
                (concat (format "%s$^{%d%s" (first row)
                                (incf i)
                                (if (equal "yes" (eighth row)) ",\\ast" ""))
                        (if (equal row (car (last recs))) "}$" "}$,")))
              recs)))
  
  (defun author-affiliation (recs)
    "Format the author affiliation list."
    (let ((i 0))
      (mapcar (lambda (row)
                (format "\\bf{%d} %s, %s, %s, %s, %s" (incf i)
                        (second row) (third row) (fourth row)
                        (fifth row) (sixth row)))
              recs)))
  (defun corresponding-email (recs)
    "Return the corresponding email."
    (mapcar (lambda (row)
              (format "%s" (if (equal "yes" (eighth row)) (seventh row) "")))
            recs))
  
  (let* ((tab (cdr (cdr tab)))
         (a (author-name tab))
         (b (author-affiliation tab))
         (c (corresponding-email tab)))
    (concat (format "\\begin{flushleft}\n{\\Large\n\\textbf{%s}\n}\n\\\\\n"
                    (jk-org-kwd kwd))
            (mapconcat 'identity a "\n") "\n\\\\\n"
            (mapconcat 'identity b "\n\\\\\n")
            "\n\\\\\n$\\ast$ E-mail: "
            (mapconcat 'identity c "\n")
            "\n\\end{flushleft}\n\\newpage"))
#+end_src

#+results: plos-one-start
#+BEGIN_latex
\begin{flushleft}
{\Large
\textbf{Structure and Growth of the Leeward Kohala Field System: An Analysis with Directed Graphs}
}
\\
Thomas S. Dye$^{1,\ast}$
\\
\bf{1} Department of Anthropology, University of Hawai`i, Honolulu, HI, USA
\\
$\ast$ E-mail: tsd@tsdye.com
\end{flushleft}
#+END_latex
*** Filter for textpm
Add the placeholder with alt-shift-+

#+name: tsd-textpm
#+begin_src emacs-lisp
(defun tsd-latex-filter-textpm (text backend info)
  "Replace textpm placeholders in Beamer/LaTeX export."
  (when (memq backend '(beamer latex))
    (replace-regexp-in-string "±" "\\textpm\\" text nil t)))
(add-to-list 'org-export-filter-plain-text-functions
             'tsd-latex-filter-textpm)
#+end_src

#+results: tsd-textpm
| tsd-latex-filter-textpm | tsd-latex-filter-textcites | tsd-latex-filter-parencites | ngz-latex-filter-nobreaks |

*** DONE Filter for table continuation strings
   :LOGBOOK:
   - State "DONE"       from "TODO"       [2013-11-07 Thu 21:05]
   :END:
#+name: tsd-continuation-strings
#+begin_src emacs-lisp
  (defun my-personal-table-continuation-strings (row backend info)
    (when (org-export-derived-backend-p backend 'latex)
      (replace-regexp-in-string
       "multicolumn{[0-9]+}{l}{\\(.*\\)}" "\\ldots\\ \\tablename\\ \\thetable{} continued from previous page"
       (replace-regexp-in-string
        "multicolumn{[0-9]+}{r}{\\(.*\\)}" "continued on next page \\ldots"
        row nil t 1) nil t 1)))
  (add-to-list 'org-export-filter-table-functions
               'my-personal-table-continuation-strings)
#+end_src

#+results: tsd-continuation-strings
| my-personal-table-continuation-strings |

